// Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.

int[,] arr = {{ 1, 4, 7, 2 },
              { 5, 9, 2, 3 },
              { 8, 4, 2, 4 }};

System.Console.Write("Среднее арифметическое каждого столбца: ");
for (int i = 0; i < arr.GetLength(1); i++)
{
    double avg = 0;
    for (int j = 0; j < arr.GetLength(0); j++)
    {
        avg += arr[j, i];
    }
    Console.Write($"{avg / 3}; ");
}